app/controllers/cabinet_controller.rb

SELECT * FROM `users` WHERE (id = 1) LIMIT 1
---
  def index
    @users = User.find(:first, :conditions => ["id = ?", session[:user]])