app/controllers/user_controller.rb

  def new
    if request.post?
        @user = User.new("name"=>params['user'][:name], "email"=>"doituself@tolearn.rails",   "password"=>params['user'][:password])
	      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `password`, `email`) VALUES('ben', '2009-06-05 10:51:17', '2009-06-05 10:51:17', '321671', 'doituself@tolearn.rails')